import React from 'react';
import NavigationLinks from 'components/NavigationLinks';

const Sandbox = () => (
  <>
    <h1><span>Компонент Button</span></h1>
    <p>Button є багаторазовим елементом користувацького інтерфейсу, який можна використовувати в різних частинах вашого веб-додатку. Він підтримує кілька станів, таких як активний (active), вимкнений (disabled), і може функціонувати як звичайна кнопка або як посилання, залежно від переданих атрибутів.</p>
    <h2><span>Застосування:</span></h2>
    <ol>
      <li><p><strong>Керування діями:</strong> Використовуйте кнопку для виконання різних дій на сторінці, таких як надсилання форми, відкриття модального вікна, виконання запиту до сервера тощо.</p></li>
      <li><p><strong>Навігація:</strong> Завдяки підтримці атрибуту href, кнопка може слугувати як посилання для навігації між сторінками вашого додатку.</p></li>
      <li><p><strong>Стан:</strong> Використовуйте прапорці active та disabled для відображення стану кнопки, що допомагає користувачам зрозуміти, чи кнопка наразі доступна для натискання чи ні.</p></li>
    </ol>
    <NavigationLinks/>
  </>
);

export default Sandbox;

