export const BUTTON = {
  title: 'Компонент Button',
  description:
    'Button є багаторазовим елементом користувацького інтерфейсу, який можна використовувати в різних частинах вашого веб-додатку. Він підтримує кілька станів, таких як активний (active), вимкнений (disabled), і може функціонувати як звичайна кнопка або як посилання, залежно від переданих атрибутів.',
  usage: [
    {
      title: 'Керування діями',
      content:
        'Використовуйте кнопку для виконання різних дій на сторінці, таких як надсилання форми, відкриття модального вікна, виконання запиту до сервера тощо.',
    },
    {
      title: 'Навігація',
      content:
        'Завдяки підтримці атрибуту href, кнопка може слугувати як посилання для навігації між сторінками вашого додатку.',
    },
    {
      title: 'Стан',
      content:
        'Використовуйте прапорці active та disabled для відображення стану кнопки, що допомагає користувачам зрозуміти, чи кнопка наразі доступна для натискання чи ні.',
    },
  ],
};

export const BUTTON_GROUP = {
  title: 'Компонент ButtonGroup',
  description:
    'Компонент ButtonGroup є контейнером для групи кнопок, який дозволяє організовувати їх в горизонтальну або вертикальну групу. Це корисний інструмент для створення структурованих та логічно згрупованих наборів кнопок у вашому веб-додатку.',
  usage: [
    {
      title: 'Групування дій',
      content:
        "Використовуйте ButtonGroup для об'єднання пов'язаних кнопок, таких як кнопки інструментів або опцій, щоб користувачі могли легко знайти і взаємодіяти з відповідними діями.",
    },
    {
      title: 'Організація інтерфейсу',
      content:
        'ButtonGroup допомагає організувати інтерфейс, забезпечуючи рівномірне вирівнювання та відступи між кнопками, що покращує загальну зручність користування.',
    },
    {
      title: 'Вибір стану',
      content:
        'Завдяки підтримці вертикального (vertical) розташування, ButtonGroup можна використовувати для створення перемикачів, списків опцій або інших елементів керування, які потребують вертикального розташування кнопок.',
    },
  ],
};

export const ICON = {
  title: 'Компонент Icon',
  description:
    'Icon є багаторазовим елементом користувацького інтерфейсу, який можна використовувати для відображення іконок у вашому веб-додатку. Він підтримує кілька станів, таких як вимкнений (disabled), і може функціонувати як кнопка, якщо передати відповідний обробник подій.',
  usage: [
    {
      title: 'Відображення іконок',
      content:
        'Використовуйте Icon для відображення різноманітних іконок, щоб покращити візуальний вигляд вашого веб-додатку.',
    },
    {
      title: 'Керування діями',
      content:
        'Завдяки підтримці обробника подій onClick, Icon можна використовувати як кнопку для виконання різних дій на сторінці.',
    },
    {
      title: 'Стан',
      content:
        'Використовуйте прапорець disabled для відображення стану іконки, що допомагає користувачам зрозуміти, чи іконка наразі доступна для взаємодії чи ні.',
    },
  ],
};

export const IMAGE = {
  title: 'Компонент Image',
  description:
    'Компонент Image використовується для відображення зображень з підтримкою різних стилів та атрибутів, таких як розмір, альтернативний текст, і можливість зробити зображення круглим.',
  usage: [
    {
      title: 'Відображення зображення',
      content:
        'Використовуйте компонент Image для відображення зображень з вказаним шляхом до файлу зображення, альтернативним текстом, шириною та висотою.',
    },
    {
      title: 'Круглі зображення',
      content:
        'Застосуйте властивість circle для того, щоб зображення відображалось як кругле.',
    },
    {
      title: 'Плейсхолдери',
      content:
        'Якщо шлях до зображення не вказаний, компонент автоматично використовує плейсхолдер з вказаними шириною та висотою.',
    },
    {
      title: 'Класи та стилі',
      content:
        'Ви можете передати додаткові класи та стилі через атрибут className для налаштування вигляду зображення.',
    },
  ],
};

export const COMPONENT_DETAILS = {
  button: BUTTON,
  buttonGroup: BUTTON_GROUP,
  icon: ICON,
  image: IMAGE,
};
