import React from 'react';
import NavigationLinks from 'components/NavigationLinks';

const Sandbox = () => (
  <>
    <h1><span>Компонент ButtonGroup</span></h1>
    <p>Компонент ButtonGroup є контейнером для групи кнопок, який дозволяє організовувати їх в горизонтальну або вертикальну групу. Це корисний інструмент для створення структурованих та логічно згрупованих наборів кнопок у вашому веб-додатку.</p>
    <h2><span>Застосування:</span></h2>
    <ol>
      <li><p><strong>Групування дій:</strong> Використовуйте ButtonGroup для об'єднання пов'язаних кнопок, таких як кнопки інструментів або опцій, щоб користувачі могли легко знайти і взаємодіяти з відповідними діями.</p></li>
      <li><p><strong>Організація інтерфейсу:</strong> ButtonGroup допомагає організувати інтерфейс, забезпечуючи рівномірне вирівнювання та відступи між кнопками, що покращує загальну зручність користування.</p></li>
      <li><p><strong>Вибір стану:</strong> Завдяки підтримці вертикального (vertical) розташування, ButtonGroup можна використовувати для створення перемикачів, списків опцій або інших елементів керування, які потребують вертикального розташування кнопок.</p></li>
    </ol>
    <NavigationLinks/>
  </>
);

export default Sandbox;